       IDENTIFICATION DIVISION.
       program-id. Program1 as "DISPLAY FATEC".
       AUTHOR.     REGINALDO_FATEC. 
       
       environment division.
       configuration section.

       data division.
       working-storage section.
       
      *****************************************
      *DISPLAY FATEC
      *****************************************
      
       procedure division.
       
           DISPLAY "FATEC   FATEC  FATEC". 

           STOP RUN.
           
             goback.

       end program Program1.
